# Self Joins

### Introduction

In this lesson, we'll move through self joins.  Self joins is when a table is joined with itself.  

> If you moved through the cross joins lesson, we already showed an example of self-joins there.

### Loading our data

In [1]:
import sqlite3
conn = sqlite3.connect('users.db')

In [2]:
import pandas as pd
root_url = "https://raw.githubusercontent.com/jigsawlabs-student/curriculum-images/main/has-many-through-bar/data/"
names = ['customers']
loaded_dfs = [pd.read_csv(f'{root_url}{name}.csv') for name in names]

In [3]:
students_df = loaded_dfs[0]
students_df = students_df.assign(tutor_id = [3, 1, 2])
students_df.to_sql('students',conn, index = False,
                             if_exists = 'replace')

3

### Getting to the self-joins

Now let's take a look at our data.

In [5]:
query = """
select s.name, tutors.name from students s join students tutors on s.id = tutors.tutor_id
"""
pd.read_sql(query, conn)

             name            name
0    bart simpson  maggie simpson
1  maggie simpson    lisa simpson
2    lisa simpson    bart simpson

### Using self joins

In [6]:
import pandas as pd
url = "https://raw.githubusercontent.com/tech-interviews-jigsaw/sql-advanced-joins/main/5-cross-joins/weather_central_park.csv"
df = pd.read_csv(url)
df = df.assign(id = df.index).iloc[:, :2]
df = df.rename(columns = {'maximum temperature': 'max_temp'})
df = df.drop(labels = [9, 13])
# df

In [7]:
df.to_sql('temperatures', conn, index = True, index_label = 'id', if_exists = 'replace')

364

In [8]:
temperature_df = pd.read_sql('select * from temperatures limit 3', conn)
temperature_df

   id      date  max_temp
0   0  1-1-2016        42
1   1  2-1-2016        40
2   2  3-1-2016        45

In [10]:
query = """
select * from temperatures t1
join temperatures t2  
on t1.id = t2.id - 1 
"""

pd.read_sql(query, conn)

      id        date  max_temp   id        date  max_temp
0      0    1-1-2016        42    1    2-1-2016        40
1      0    1-1-2016        42    2    3-1-2016        45
2      1    2-1-2016        40    2    3-1-2016        45
3      1    2-1-2016        40    3    4-1-2016        36
4      2    3-1-2016        45    3    4-1-2016        36
..   ...         ...       ...  ...         ...       ...
716  362  28-12-2016        40  363  29-12-2016        46
717  362  28-12-2016        40  364  30-12-2016        40
718  363  29-12-2016        46  364  30-12-2016        40
719  363  29-12-2016        46  365  31-12-2016        44
720  364  30-12-2016        40  365  31-12-2016        44

[721 rows x 6 columns]